---
kind: method
id: M:Autodesk.Revit.DB.ViewDisplayBackground.CreateSky
source: html/141c56d0-ed89-dcd9-a1b9-8fc9655040d7.htm
---
# Autodesk.Revit.DB.ViewDisplayBackground.CreateSky Method

Creates an object that can be passed to View.SetBackground method
 to set the background of the SunAndClouds type.

## Syntax (C#)
```csharp
public static ViewDisplayBackground CreateSky()
```

## Returns
New background object to pass to View.SetBackground .